// 1. ლოგიკური ოპერატორებია ისეთი ოპერატორები რომლებიც გამოიყენება რომ შეადარო სხვა რაღაცეებს და იყენებენ ture/false
// 2. false && true || 'name' === 'Name' && 1 == '1' გამოიტანს  name === name გამოიტანს  true-ს ხოლო 1 === '1'გამოიტანს falseX რადგან ერთი 1 არის 
// ინტეგერი ხოლო მეორე არის სტრინგი
// და ისინი ერთიდაიგივე არ არიან ხოლო name ები ორივენი ერთიდაიგივე სიტყვები არიან
// 3. კომენტარის სახით ახსენით რას გამოიტანს და რატომ: true || false  && false && 10 === 10.0 false and false არის false რადგან სხვა არჩევანი არ არის
//   და 10 ===10.0 არის false რადგან 10.0 არუის ბულიანი და არა სტრინიგი
// 4. : true && false || !false == true & true   პირველში true and false გამოიტანს true რადგან true მხარს უჭერს and-ს და
//  true and true გამოიტანსა true-ს რადგამ true and-ს უჭერს მხარს
// 5. ?


let num = 15

 let userNum = prompt ('enter you number :')
    console.log(userNum == num)

