//შექმენით 5 ელემენტიანი სია, სიიდან ამოშალეთ ბოლო ელემენტი და ჩაამატეთ ახალი ელემენტი.


// let list = [1,3,4,5,6,7,8,8,9,0]
// list.pop()
// list.push(12)


// console.log(list)


// შექმენით 5 ელემენტიანი სია,  სიიდან ამოშალეთ მე-0 ინდექსზე მდგომი ელემენტი და დაამატეთ ახალი ელემენტი მის მაგივრად.

// let list = [1,2,3,4,5,6,7,8,9,10]
// list.shift()
// list.unshift(55)

// console.log(list)


// შექმენით 5 ელემენტიანი სია, მომხმარებლის შემოტანილი მნიშვნელობა
// დაამატეთ ამ სიაში იმ შემთხვევაში თუ ეს ელემენტი არ არის სიაში, თუ არის მაშინ ამოშალეთ. და კონსოლში გამოიტანეთ ახალი სია.


// let list = [1,2,3,4,5]
// let list1 = Number(prompt('enter youre number please : '))

// if(list.includes(list)){
//    list.indexof(list1)
//    list.splice(list.indexof(list1),1)
// }

// else{
//    (list.includes(list))
//    list.indexof(list1)
//    list.push(list1)
// }


//შექმენით  10 ელემენტიანი სია. მომხმარებელს შემოატანინეთ რიცხვი, 
// შემოტანილი რიცხვი გამოიყენეთ როგორც ინდექსად და მომდევნო სამი ელემენტი წაშალეთ. შედეგი გამოიტანეთ კონსოლში.


// let list = [1,2,3,4,5,6,7,8,9,10]
// let list1 =Number(prompt('enter youre number'))


// list.splice(list1,4 )

// console.log(list)