// 5)დაატრიალეთ ფორ ციკლი 20 ჯერთქვენიდ ავალებაა რომ გამოიტანოთ ასეთი რამ -->

// girogi1
// girogi2
// girogi3
// giorgi4
// ....
// giorgi20

// 6)შექმენი ცვლადი სადაც შეინახავ ნამბერ ტიპის მონაცემს,თქვენი დავალებაა რომ 0 იდან ამ რიცხვამდე რაც ცვლადში შეინახეთ დაატრიალოთ ფორ ციკლი და კონსოლში გმოიტანოთ ეს რიცხვები

// 7)შექმენი 2 ცვლადი სადაც შეინხავ ნამბერ ტიპის მონაცემს,თქვენი დავალებაა რომ ფორ ციკლი დაატროალი პირველი რიცხვიდან(რაც ცვლადში გაქვთ) მეორე რიცხვამდე(რაც მეორე ცვლადში გაქვთ) და გამოიტანოთ  რიცხვები კონსოლში


// 5. 

// for (let i=0;i < 20;i +=1 ){
//     console.log('giorgi'+i )
// }


// 6. 
// let num1 = 1
// for (let i=0;i < 20;i += 1 ){
//     console.log(num1)
// }

//7

// let num1 = 1
// let num2 = 40


// for (let i=0;i < 40;i +=1){
//     console.log(num1 < num2 )
// }

// მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვის ჩათვლით გამოიტანეთ ყველა რიცვხვი.
// მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვის ჩათვლით გამოიტანეთ ყველა ლუწი რიცხვი
// მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვიდან 0-მდე გამოიტანეთ ყველა რიცხვი


//8


// let  num1 = Number(prompt ('enter you number '))


// for (let i=0; i < num1; i +=1){
//     console.log(i)
// }

//9
// let  num1 = Number(prompt ('enter you number '))
// for(let i=0; i < num1; i +=1){
//     if(num1 % 2 === 0 ){
//         console.log(i)
//     }
       
// } 


//10

let  num1 = Number(prompt ('enter you number '))
for(let i=0;i < num1; i -=1){
    console.log(i)
}