// 1)დაატრიალეთ for ციკლი 0 იდან 20 მდე  და კონსოლში გამოიტანე თიოეული რიცხვი
 
// 2)დაატრიალეთ for ციკლი 5 იდან 50 მმდე  და კონსოლში გამოიტანე თიოეული რიცხვი

// 3)დაატრიალეთ for ციკლი 10 იდან 100 მდე 5 ის გამოტოვებით და კონსოლში გამოიტანე თიოეული რიცხვი

// 4)ფორ ციკლის დახმარებით კონსოლში გამოიტანეთ თქვენი სახელი 20 ჯერ


// 1. 


// for (let i = 0;i < 20;i +=1){
//     console.log(i)
// }

// 2.

// for(let zaza = 5;zaza <  50;zaza +=1){
//     console.log(zaza)
// }


// 3.

// for(let i =10;i < 100;i +=5){
//     console.log(i)
// }

// 4. 

// for (let i =0 ;i < 20;i += 1){
//     console.log('mate')
// }