// //  1.შექმენით ორი ცვლადი სადაც შეინახავთ რიცხვებს. კონსოლში გამოიტანეთ ამ ორი რიცხვის ჯამი.


// let num1 = 14

// let num2 = 16

// console.log (num1 + num2)

// // 2.შექმენით ცვლადი სადაც შეინახავთ თქვენს სახელს და alert-ში გამოიტანეთ "გამარჯობა {ცვლასის მნიშვნელობა}.


// let word = 'გამარჯობა'

// alert (word)


// // 3.შექმენით ცვლადები let-ით const-ით და var-ით და კომენტარის სახით განმარტეთ თითოეული მათგანი. კონსოლში გამოიტანეთ ამ ცვლადის მნიშვნელობები


// let word1 = 'გამარჯობა'

// var word2 = 'მე'

// const word3 = 'მათე ვარ'



// let-არის ცვლადის შექმნის ერთერთი ხერხი რომლის განახლებაც შეგიძლია
// var-არის ცვლადის შექმნის ერთერთ ხერხი რომლის განახლებაც შეგიძლია
// const-არის ცვლადი შექმნის ერთერთი ხერხი რომლის განახლებაც არ შეგიძლია
//var-სა და let-ს შორის განსხვავება ისაა რომ var-არის ძვლეი ვერსია let თანამედროვე


// 4.შექმენით ცვლადები let-ით const-ით და var-ით, თითოეული მათგანის მნიშვნელობა გაანახლეთ ბევრჯერ და
//  კონსოლში გამოიტანეთ შედეგი. რაც არ იმუშავებს განმარტეთ რატომ არ მუშაობს.

//   let name = 'მათე '
//   name = 'სვარჩიკა მაყვალა' //გაბრიელ მასწის სახელია


//  var name1 = 'ქესკირი' // ეს უკვე ჩემია
//  name1 = 'ჯუმბერა' // ეს უკვე გაბრიელ მასწისაა

// //  const name2 = 'ჯემალი '
// //  name2 = 'გულიკო'  // აქ უკვე ჩემია ორივე


//  console.log(name)
//  console.log(name1)
// //  console.log(name2) --- const-ზე არ ნახლდება



// 5.შექმენით 2 ცვლადი სადაც შეინახავთ Number ტიპის მონაცემებს. კონსოლში გამოიტანეთ ამ ორ რიცხვზე შესრულებული ყველა მათემატიკური მოქმედება.


// let num1 = 12
// let num2 = 23

// console.log(num1 + num2)
// console.log(num1 * num2)
// console.log(num1 - num2)
// console.log(num1 / num2)

// 6.შექმენით ცვლადი რომლის თავდაპირველი მნიშვნელობა იქნება Number ტიპის მონაცემი, გაანახლეთ და შემდეგ Bool ტიპის მონაცემი შეინახეთ, შემდეგ string 
// ტიპის და გამოიტანეთ შედეგი კონსოლში. ალერტში გამოიტანეთ ტექსტი "შეამიწმე კონსოლი



// let num1 = 12

// num1 = true


// num1 = 'svarchika mayvala'

// console.log(num1)


// alert(num1)


// 7.შექმენით ცვლადი სადაც შეინახავთ რიცხვს და ამ ცვლადის მნიშვნელობა გაანახლეთ და გაზარდეთ 10-ით, შედეგი კონსოლში გამოიტანეთ.


// let num1 = 34


// num1 = num1 + 10

// console.log(num1)