// 1. for loop - ის გამოყენებით გამოიტანეთ 0-დან 200-მდე რიცხვები.


// for (let i = 0;i < 200;i +=1){
//     console.log(i)
// }

// 2. for loop - ისგამოყენებით გამოიტანეთ რიცხვები 5-დან 300-მდე 10-ის მიმატებით.

// for (let i = 5;i <300;i +=10){
//     console.log(i)
// }

// 3. for loop-ის გამოყენებით 100-დან 1-ის ჩათვლით უკუსვლით გამოიტანეთ ყველა რიცხვი.

// for (let i =100;i > 0;i -=1){
//     console.log(i)
// }

// 4. 4-დან 100-მდე გამოიტანეთ ყველა კენტი რიცხვი. ოღონდ შეამოწმეთ if/else-თი.


// for (let i = 4;i < 100;i +=1){
//     if(i % 2 ===1)
//         console.log(i)
// }

// 5. 