//1)while loop ის დახმარებით გამოიტანეთ რიცხვები 0 იდან 10 მდე კონსოლში.

// 2)while loop ის დახმარებით გამოიტანეთ თქვენი სახელი 20 ჯერ კონსოლში

// 3)დაატრიალეთ while loop 1 იდან 20 მდე და გამოიტანეთ კონსოლში ყველა ლუწი რიცხვი(გამოიყენეთ if else)

// 4)შექმენი 4 სია ,ერთ სიაში შეინახეთ სულ სტრინგები,მერე სიაში შეინახე სულ ინტეჯერები,მესამე სიაში შეინახეთ სულ float ები,და მეოთხე სიაში
//  შეინახეთ სულ boolean ები,ასევე შექმენი ბოლოს მეხთე სია სადაც შეინახავ ოთხივე ტიპის მონაცემს ერთად

// 1
// let i = 0
// while(i < 10){
//     console.log(i)
// i++
// }


// 2
// let i = 0 
// let name = 'mate'
// while(mate < 20){
//     console.log(i)
//     i++
// }


// 3 

// let i = 0 

// while(i < 20){
//     if(i % 2 ===0){
//         console.log(i)
//     }
// }



// 4


// let float =[1.1,123.32,132.31]
// let bool =[123<32,1322>32,98>43]
// let num =[1,23,7,8,9,0]
// let string = ['mate','mate','mate']
// let all = ['mate',12,12>32,1.32,]


// 5